In [4]:
import pandas as pd
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])

In [5]:
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [6]:
# Crie um DataFrame somente com os alunos aprovados.
selecao = alunos['Aprovado'] == True
aprovados = alunos[selecao].shape[0]
aprovados

4

In [7]:
# Crie um DataFrame somente com as alunas aprovadas.
selecao = (alunos.Sexo == 'F') & (alunos.Aprovado == True)
n2 = alunos[selecao]
n2

    Nome  Idade Sexo  Notas  Aprovado
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [8]:
# Crie apenas uma visualização dos alunos com idade entre 10 e 20 anos ou com idade maior ou igual a 40 anos.
# 10 <= idade <= 20 
# idade >= 40
selecao = ((alunos.Idade > 10) & (alunos.Idade < 20)) | (alunos.Idade >= 40)
alunos[selecao]

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
2   Denis     56    M    5.0     False
4   Bruna     42    F    8.2      True
6  Carlos     19    M    6.0     False

In [9]:
# Crie um DataFrame 
# somente com os alunos reprovados e mantenha neste DataFrame 
# apenas as colunas Nome, Sexo e Idade, nesta ordem.

In [12]:
selecao = alunos['Aprovado'] == False
reprovados = alunos.loc[selecao, ['Nome', 'Sexo', 'Idade']]
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [15]:
selecao = alunos['Aprovado'] == False
reprovados = alunos[['Nome', 'Idade',  'Sexo']][selecao]
reprovados

     Nome  Idade Sexo
1   Cátia     27    F
2   Denis     56    M
6  Carlos     19    M
7   Alice     35    F

In [ ]:
# Crie uma visualização com os três alunos mais novos.

In [19]:
# Opção Correta!
alunos.sort_values(by = ['Idade'], inplace = True)
alunos.iloc[:3]

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
6  Carlos     19    M    6.0     False
5    Dara     21    F    7.0      True

In [17]:
# Opção Errada!
alunos.sort_values(by = ['Idade'], inplace = True)
alunos.iloc[3]

Nome        Cátia
Idade          27
Sexo            F
Notas         2.5
Aprovado    False
Name: 1, dtype: object

In [18]:
# Opção Errada!
alunos.sort_values(by = ['Idade'], inplace = True)
alunos.iloc[1:3]

     Nome  Idade Sexo  Notas  Aprovado
6  Carlos     19    M    6.0     False
5    Dara     21    F    7.0      True